myquote/app/views/home/aindex.html.erb

SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "quotes"
SELECT COUNT(*) FROM "categories"
SELECT COUNT(*) FROM "philosophers"
---
<div class="row g-3 mb-4">
  <div class="col-md-3"><div class="card p-3">Users: <strong><%= User.count %></strong></div></div>
  <div class="col-md-3"><div class="card p-3">Quotes: <strong><%= Quote.count %></strong></div></div>
  <div class="col-md-3"><div class="card p-3">Categories: <strong><%= Category.count %></strong></div></div>
  <div class="col-md-3"><div class="card p-3">Philosophers: <strong><%= Philosopher.count %></strong></div></div>

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (4, 2, 7, 1, 8, 10, 12, 13)
SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" IN (14, 5, 12, 10, 7, 8, 6, 4, 2)
SELECT "quotes".* FROM "quotes" WHERE "quotes"."is_public" = 1 ORDER BY "quotes"."created_at" DESC LIMIT 10
SELECT "users".* FROM "users" WHERE "users"."id" IN (3, 12, 9, 8, 7, 4, 5, 1)
---
<ul class="list-group">
  <% Quote.includes(:user, :philosopher, :categories)
          .where(is_public: true)
          .order(created_at: :desc)
          .limit(10).each do |q| %>