myquote/app/views/home/index.html.erb

SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" IN (14, 5, 12, 10, 7, 8, 6, 4, 2)
---
      <div class="small text-muted">
        — <%= [q.philosopher&.first_name, q.philosopher&.last_name].compact.join(' ').presence || 'Anonymous' %>