myquote/app/controllers/home_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (4, 2, 7, 1, 8, 10, 12, 13)
SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" IN (14, 5, 12, 10, 7, 8, 6, 4, 2)
SELECT "quotes".* FROM "quotes" WHERE "quotes"."is_public" = 1 ORDER BY "quotes"."created_at" DESC LIMIT 10
SELECT "users".* FROM "users" WHERE "users"."id" IN (3, 12, 9, 8, 7, 4, 5, 1)
---
  def index
    @quotes = Quote.includes(:user, :philosopher, :categories)
                   .where(is_public: true)
                   .order(created_at: :desc)
                   .limit(10)

SELECT COUNT(*) FROM "users"
SELECT COUNT(*) FROM "quotes"
SELECT COUNT(*) FROM "categories"
SELECT COUNT(*) FROM "philosophers"
---
  def aindex
    @users_count = User.count
    @quotes_count = Quote.count
    @categories_count = Category.count
    @philosophers_count = Philosopher.count

SELECT COUNT(*) FROM "quotes" WHERE "quotes"."user_id" = 2
---
  def uindex
    @my_quotes_count = current_user.quotes.count