myquote/app/controllers/philosophers_controller.rb

  def index
    @philosophers = Philosopher.all
---
SELECT "philosophers".* FROM "philosophers"