myquote/app/controllers/quotes_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (1, 4)
SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" IN (2, 14, 5, 12, 10, 7, 8, 6, 4, 3)
SELECT "quotes".* FROM "quotes" WHERE "quotes"."user_id" = 1 ORDER BY "quotes"."created_at" DESC
SELECT "quotes".* FROM "quotes" WHERE "quotes"."is_public" = 1 ORDER BY "quotes"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 3, 12, 9, 8, 7, 4, 5, 2)
---
  def index
    if params[:q] == 'mine' && logged_in?
      # Show only current user's quotes
      @quotes = current_user.quotes.includes(:philosopher, :categories).order(created_at: :desc)
    else
      # Public list of quotes (only public ones)
      @quotes = Quote.includes(:philosopher, :categories, :user)
                     .where(is_public: true)
                     .order(created_at: :desc)

INSERT INTO "quotes" ("quote_text", "publication_year", "owner_comment", "is_public", "user_id", "philosopher_id", "created_at", "updated_at") VALUES ('Hello world', 1800, 'First comment', 1, 1, 2, '2025-10-23 13:40:45.553877', '2025-10-23 13:40:45.553877') RETURNING "id"
---
  def create
    @quote = Quote.new(quote_params)
    @quote.user = current_user

    if @quote.save

UPDATE "quotes" SET "is_public" = 0, "updated_at" = '2025-10-23 13:42:29.993198' WHERE "quotes"."id" = 14
---
  def update
    if @quote.update(quote_params)

SELECT "philosophers".* FROM "philosophers" ORDER BY "philosophers"."last_name" ASC, "philosophers"."first_name" ASC
SELECT "categories"."name", "categories"."id" FROM "categories" ORDER BY "categories"."name" ASC
---
    def load_form_dependencies
      # Build "Full Name or Anonymous" list for select
      @philosophers = Philosopher.order(:last_name, :first_name).map { |p|
        [ [p.first_name, p.last_name].compact.join(' ').presence || 'Anonymous', p.id ]
      }
      # Category options as [name, id]
      @categories = Category.order(:name).pluck(:name, :id)