myquote/app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:email].to_s.downcase.strip)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'admin@myquotes.com' LIMIT 1