myquote/app/controllers/users_controller.rb

  def index
    # Admin-only list of users
    @users = User.order(:lname, :fname)
---
SELECT "users".* FROM "users" ORDER BY "users"."lname" ASC, "users"."fname" ASC

  def update
    # Admins may change status/role; users cannot
    permitted = is_administrator? ? admin_update_params : user_update_params
    if @user.update(permitted)
---
UPDATE "users" SET "lname" = 'Man', "is_admin" = 1, "updated_at" = '2025-10-23 13:46:08.985134' WHERE "users"."id" = 8

  def destroy
    # Admin deletes user (cascades quotes)
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = 5