myquote/app/views/quotes/_form.html.erb

SELECT "categories"."id" FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = 14
---
    <%= f.label :category_ids, 'Categories', class: 'form-label' %>
    <%= f.select :category_ids, options_for_select(@categories, f.object.category_ids),
                 {}, multiple: true, class: 'form-select', size: 6 %>