myquote/app/views/quotes/show.html.erb

SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" = 2 LIMIT 1
---
  <strong>Source:</strong>
  <%= [@quote.philosopher&.first_name, @quote.philosopher&.last_name].compact.join(' ').presence || 'Anonymous' %>

SELECT "categories".* FROM "categories" INNER JOIN "quote_categories" ON "categories"."id" = "quote_categories"."category_id" WHERE "quote_categories"."quote_id" = 14
---
<% end %>
<p><strong>Categories:</strong> <%= @quote.categories.map(&:name).join(', ') %></p>